Revit 2027 API
ParameterFilterUtilities.GetInapplicableParameters Method
 Returns the parameters that are not among the set of filterable parameters common to the given categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetInapplicableParameters(
	Document aDoc,
	ICollection<ElementId> categories,
	IList<ElementId> parameters
)
Public Shared Function GetInapplicableParameters (
	aDoc As Document,
	categories As ICollection(Of ElementId),
	parameters As IList(Of ElementId)
) As IList(Of ElementId)
public:
static IList<ElementId^>^ GetInapplicableParameters(
	Document^ aDoc,
	ICollection<ElementId^>^ categories,
	IList<ElementId^>^ parameters
)
static member GetInapplicableParameters :
        aDoc : Document *
        categories : ICollection<ElementId> *
        parameters : IList<ElementId> -> IList<ElementId>
Parameters
aDoc Document
 The document containing the categories and parameters to query.
categories ICollection<ElementId>
 The categories that define the set of possibly filterable parameters.
parameters IList<ElementId>
 The parameters desired for use in a parameter filter.
Return Value
IList<ElementId>
 A list of parameters from the given array that are not valid for use in a parameter filter with the given categories.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterFilterUtilities Class
Autodesk.Revit.DB Namespace